EDT/УТ/src/Documents/УчетПриемаСотрудниковВITИнфраструктуре_КУдалению/УчетПриемаСотрудниковВITИнфраструктуре_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетПриемаСотрудниковВITИнфраструктуре_КУдалению</name>
  <registerRecords>InformationRegister.УчетСотрудниковВITИнфраструктуре_КУудалению</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетныеСистемыКомпании</name>
    <attributes>
      <name>УчетнаяСистема</name>
      <type>
        <types>CatalogRef.УчетныеСистемыКомпании_КУдалению</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Логин</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУчетныхДанных</name>
      <type>
        <types>EnumRef.СостояниеУчетныхДанныхВITИнфраструктуреКомпании_КУдалению</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаУчетныхСистем</name>
    <attributes>
      <name>ТипУчетнойСистемы</name>
      <type>
        <types>CatalogRef.УчетныеСистемыКомпании_КУдалению</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетнаяСистема</name>
      <type>
        <types>CatalogRef.УчетныеСистемыКомпанииНаБазе1С_КУдалению</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/УчетПриемаСотрудниковВITИнфраструктуре_КУдалению/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетСотрудниковВITИнфраструктуре
	Движения.УчетСотрудниковВITИнфраструктуре.Записывать = Истина;
	Движения.УчетСотрудниковВITИнфраструктуре.Очистить();
	Для Каждого ТекСтрокаУчетныеСистемыКомпании Из УчетныеСистемыКомпании Цикл
		Движение = Движения.УчетСотрудниковВITИнфраструктуре.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.УчетнаяСистема = ТекСтрокаУчетныеСистемыКомпании.УчетнаяСистема;
		Движение.СостояниеУчетныхДанных = ТекСтрокаУчетныеСистемыКомпании.СостояниеУчетныхДанных;
		Движение.Ответственный = ТекСтрокаУчетныеСистемыКомпании.Ответственный;
		Движение.СостояниеСотрудника = Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию;
		Движение.Логин = ТекСтрокаУчетныеСистемыКомпании.Логин;
		Движение.Пользователь = Пользователь;
		Движение.Регион = Регион;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
